select round(91787.00 / 1000 * 12.54 * nvl(1.2, '0'), 2)                                     当年度基本保额红利,
       round(278.5 / 1000 * nvl(12.36, 0) * nvl(1.2, '0'),
             2)                                                                              已产生的减额交清红利,
       round(91787.00 / 1000 * 12.54 * nvl(1.2, '0'), 2) +
       round(278.5 / 1000 * nvl(12.36, 0) * nvl(1.2, '0'),
             2)                                                                              当年度总和,
       round((round(91787.00 / 1000 * 12.54 * nvl(1.2, '0'), 2) +
              round(278.5 / 1000 * nvl(12.36, 0) * nvl(1.2, '0'), 2)) * 1000 / 1026.6149, 2) 当年度减额交清红利
from dual;


