--犹豫期
select HESITATEEND
from LMEdorWT
where riskcode = '1303022';

--还款利息
select round(1000 * 0.03 / 365 * (date '2026-07-20' - date '2026-06-10' - 1), 2) 还款利息
from dual;

--月结利息
--月结利息=日利率*经过天数*结息时的账户价值
Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2026-05-01' - date'2026-04-29') * 10670/*结息时的账户价值*/, 2) 月结利息
from dual;

Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2026-06-01' - date'2026-05-01') * 10671.73/*结息时的账户价值*/, 2) 月结利息
from dual;

Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2026-07-01' - date'2026-06-01') * 10698.55/*结息时的账户价值*/, 2) 月结利息
from dual;

Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2026-08-01' - date'2026-07-01') * 10724.57/*结息时的账户价值*/, 2) 月结利息
from dual;

--风险保费
/*
风险保费=死亡风险保额/1000*到达年龄时的风险保费费率/365*月结当月总天数
死亡风险保额：有效保额（被保险人因疾病和意外等身故时，我们支付的身故保险金额）-保单账户价值
到达年龄：投保年龄+保单年度数-1
*/
select round((10751.53 * 1.2 - 10751.53) / 1000 * 29.5 / 365 * (date'2026-09-01' - date'2026-08-01'), 2) 风险保费
from dual;

--追加保费相关费用
--初始保费
select 10000 * 0.03 初始保费
from dual;
--风险保费
select round((9700 * 1.2 - 9700) / 1000 * 34.5 / 365 * (date'2027-07-01' - date'2027-06-10'), 2) 风险保费
from dual;

--贷款停效后复效利息计算
--INTERESTRATE修改贷款利率
select a.*
from LOLOANMAIN a
where contno = '2026042800004286';
--贷款停效批处理
select a.*
from ldtask a
where TASKDESCRIBE like '%贷款停效%';
--复效利息
select round(15905.66 * round(0.03 / 365, 8) * (date '2028-02-10' - date '2027-07-11'), 2) 复效利息
from dual;

--部分领取风险保费
select round((1000 * 1.2 - 1000) / 1000 * 40.3 / 365 * (date'2028-07-01' - date'2028-06-10'), 2) 风险保费
from dual;

--退保现价
--月结利息
Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2028-07-10' - date'2028-07-01' + 1) * 20191.34/*结息时的账户价值*/, 2) 月结利息
from dual;
--16.37
--风险保费
select round(13.83 / 31 * (date'2028-07-31' - date'2028-07-10'), 2) 风险保费
from dual;
--9.37
--总现价
select 20191.34 + 16.37 + 9.37
from dual;

--协议退保
select 98026.59 + round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
                        (date'2026-09-10' - date'2026-09-01' + 1) * 98026.59/*结息时的账户价值*/, 2) 现价
from dual;

--持续奖金
--月结利息
Select round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
             (date'2031-04-29' - date'2031-04-01') * 21337.77/*结息时的账户价值*/, 2) 月结利息
from dual;
--48.44
--总现价
select 21337.77 + 48.44
from dual;
--21386.21
--持续奖金
select round(21386.21 * 0.03, 2)
from dual;
--641.59

--满期金
select 21386.21 + 641.59
from dual;

--理赔
select 9794.56 + round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
                       (date'2026-09-10' - date'2026-09-01' + 1) * 9794.56/*结息时的账户价值*/, 2) 现价,
       round((9794.56 + round(round((power(1 + 0.03, 1 / 12) - 1) * 12 / 365, 8)/*将年利率0.03转化为日利率*/*
                              (date'2026-09-10' - date'2026-09-01' + 1) * 9794.56/*结息时的账户价值*/, 2)) * 1.4,
             2)                                                                                    现价乘比例
from dual;

